export const events = [
    {
      "id": 16,
      "title": "Frontend Conf",
      "description": "Самая масштабная офлайн конференция по фронтенду в России.\r\nПочему это нельзя пропустить?\r\n50+ докладчиков, которых мы лично отобрали, среди которых точно будет много интересного.\r\n700++ участников и все из IT - сообщества. И все интересуются тем же, хорошая база для новых знакомств.\r\n2 дня Вы не просто слушаете — вы обсуждаете, оспариваете, соглашаетесь, задаёте вопросы.",
      "url": "https://frontendconf.ru/moscow/2023",
      "image": "http://80.87.107.15/media/events/image/%D0%A1%D0%BD%D0%B8%D0%BC%D0%BE%D0%BA_%D1%8D%D0%BA%D1%80%D0%B0%D0%BD%D0%B0_2023-06-09_%D0%B2_23.07.11.jpg",
      "image_small": null,
      "program": "2 октября\t\t\t\r\nОткрытие\t\t\t\r\nОтказаться от зависимостей и не умереть / Илья Черторыльский (Райффайзен Банк)\tЗнаете, я тоже сам своего рода стример: SSR и Server Components / Антон Петров (Garage Eight)\t\t\t\t\r\nКак мы ускорили мобильную версию ВКонтакте в 4 раза / Тарас Иванов (Вконтакте)\tWebGL: пять приемов работы с анимациями и 3D / Иван Тельтевский (Мэйк)\t\t\t\r\nОбед\r\nХроники CSS / Людмила Мжачих (Вконтакте)\t\t\t\t\t\r\nРефакторинг приложений на JS и не только / Алексей Золотых (МойОфис)\tОбед\t\t\t\t\t\r\nЗагрузка прошла успешно: секреты командной адаптации разных уровней разработчиков / Андрей Смирнов (X5 Tech)\tFigma-Люмус-Максима: как ускорить работу в редакторе без волшебной палочки / Дмитрий Морозов (Почтатех)\t\t\t\t\t\r\nАлло, мы с нижнего этажа, у вас стили протекают / Никита Дубко (Яндекс)\tОценки задач: управление неопределенностью / Александра Прокшина (Авито)\t\t\t\t\t\r\nКогда сгорел дотла / Юлия Ротанина (Райффайзен Банк)\tПрограммируем движение / Никита Балихин (Газпромбанк)\t\t\t\t\r\nAfterparty\t\r\n3 октября\t\t\t\t\t\r\nПуть к безопасному фронтенду. Через велосипеды к комплексной системе анализа кода / Олег Коровин (Самокат)\r\nКак мы переписали форму подачи объявления под Backend-Driven UI / Владимир Кулишин (Циан)\t\t\t\t\t\r\nМикросервис головного мозга. Диспетчерская поверхностей / Михаил Трифонов (Cloud)\t\tИспользование телефона для взаимодействия и расширения UX в веб интерфейсах / Олег Рогов (НЛМК ИТ)\r\nОбед\r\nЧто не так с нашим домом и как с этим жить? / Игорь Костяков (IBS Dunice)\tКак мы развиваем цифровую доступность в B2B-корпорации / Анастасия Суховерхова (Контур)\t\t\t\t\r\nПочему компаниям не нужен архитектор? / Игорь Симдянов (Нетология)\tОбед\t\t\t\t\r\nМетод трёх фичафризов / Дарья Корчуганова (Газпромбанк)\tСоединяя микросервисы: gRPC и стриминг в современных JavaScript-приложениях / Михаил Вовренчук (Почтатех)\t\t\r\nНавыки продаж в разработке / Андрей Кузнецов (РБС)\tАрхитектура большого фронтенда - это ваш бизнес и процессы в командах / Роман Винокуров (Тинькофф)\t\t\r\nТогда мы идем к вам: как выстроить процесс работы с техдолгом внутри компании / Андрей Ермаков (СберМаркет Tech)\t\t\t\t\r\nЗакрытие",
      "organizer": "Тест",
      "partners": "Компания \"Синимекс\" - ведущий разработчик и интегратор комплексных ИТ-решений для бизнеса.",
      "address": "Москва, Берсеневская наб., 6, стр. 3этаж 4",
      "price": "48000.00",
      "date_start": "2023-10-02T10:40:00Z",
      "date_end": "2023-10-03T19:00:00Z",
      "created_at": "2023-06-09T20:27:49.539000Z",
      "city": "Москва",
      "tags": [
        {
          "id": 32,
          "name": "Architecture and patterns",
          "slug": "architecturepatterns"
        },
        {
          "id": 28,
          "name": "FrontOps",
          "slug": "frontops"
        },
        {
          "id": 30,
          "name": "Interface design",
          "slug": "interfacedesign"
        },
        {
          "id": 8,
          "name": "JavaScript",
          "slug": "javascript"
        }
      ],
      "topic": [
        {
          "id": 14,
          "name": "Frontend",
          "slug": "frontend"
        }
      ],
      "format": [
        {
          "id": 2,
          "name": "Offline",
          "slug": "offline"
        }
      ],
      "isLiked": true
    },
    {
      "id": 35,
      "title": "DevOops. Конференция по инженерным решениям и DevOps-культуре",
      "description": "DevOops — конференция от JUG Ru Group, посвященная практикам DevOps. Она объединяет специалистов по разработке и эксплуатации, чтобы в итоге все могли релизить чаще, а чинить быстрее и надежнее.",
      "url": "https://devoops.ru",
      "image": "http://80.87.107.15/media/events/image/%D0%A1%D0%BD%D0%B8%D0%BC%D0%BE%D0%BA_%D1%8D%D0%BA%D1%80%D0%B0%D0%BD%D0%B0_2023-06-10_085724.png",
      "image_small": null,
      "program": "Смотреть на сайте организатора",
      "organizer": "Тест",
      "partners": "VK,",
      "address": "Отель МонАрх: Ленинградский пр-т, 31А, стр.",
      "price": "15000.00",
      "date_start": "2023-09-17T10:00:00Z",
      "date_end": "2023-09-18T22:00:00Z",
      "created_at": "2023-06-10T05:57:49.374000Z",
      "city": "Москва",
      "tags": [
        {
          "id": 3,
          "name": "Docker",
          "slug": "docker"
        }
      ],
      "topic": [
        {
          "id": 10,
          "name": "DevOps",
          "slug": "devops"
        }
      ],
      "format": [
        {
          "id": 1,
          "name": "Online",
          "slug": "online"
        }
      ],
      "isLiked": true
    },
    {
      "id": 110,
      "title": "Heisenbug",
      "description": "Heisenbug — крупнейшая в России конференция по тестированию программного обеспечения. В программе выступления разного формата: от 25 до 45 минут и более, с 10 утра до 7 вечера.\r\n\r\nДоклады и дискуссии для специалистов разных профилей: QA-инженеров, разработчиков, тимлидов, директоров по качеству. Конференция больше ориентирована на технологии, чем на процессы и методологии. Ее организатор — JUG Ru Group.",
      "url": "https://heisenbug.ru/",
      "image": "http://80.87.107.15/media/events/image/93204a92-b2fd-4147-8013-4261a5489469.png",
      "image_small": "http://80.87.107.15/media/events/image/f3d691a2-3f61-4db6-bb6c-775c68c3979c.png",
      "program": "Метрики в тестировании, или Как большой брат следит за вами\r\nДоклад на русском языкеRU\r\nНа основе опыта построения метрик в Ситимобиле, Яндексе, СберЗвуке, ВК Александр расскажет о том, какие метрики полезные, какие в его команде делали и ошибались в ценности этих метрик, какие знания можно из них извлечь и как их используют менеджеры. Будет и несколько смешных случаев из жизни, связанных с метриками тестирования.\r\n\r\nСпикеры\r\n\r\nАлександр Петров\r\nКомпания:ВКонтакте для бизнеса\r\n\r\npg_profile — утилита стратегического мониторинга PostgreSQL\r\nДоклад на русском языкеRU\r\nОсновная задача стратегического мониторинга — предоставление количественной информации о наиболее ресурсоемких активностях СУБД. Такая информация очень полезна для анализа нагрузки СУБД, например, при проведении нагрузочного тестирования.\r\n\r\nСтратегический мониторинг сам по себе никакие проблемы не решает, но может подсказать, на что обратить внимание. Одним из средств стратегического мониторинга является расширение pg_profile/pgpro_pwr. Спикер расскажет об архитектуре, возможностях, особенностях работы и способах применения этих расширений.\r\n\r\nДоклад будет интересен всем тем, кто работает с СУБД Postgres — администраторам баз данных, инженерам нагрузочного тестирования и разработчикам приложений, непосредственно взаимодействующих с базами данных Postgres.\r\nКак мы оптимизировали запуски е2е и дооптимизировались\r\nДоклад на русском языкеRU\r\nПеред командой спикера стояла задача научиться запускать е2е API-тесты для конкретного сервиса без боли и лишних тестов. В докладе Алексей поделится, как они дошли до запуска тестов по трейсам, какие с этим есть проблемы и как это помогло им ускорить пайплайны.\r\n\r\nВ докладе будет использоваться pytest+xdist. Сервис оптимизации был написан на Go, но его рассмотрим только схематично, без привязки к языку. Также спикер расскажет, как они раскладывали тесты по воркерам и ускоряли конкретный запуск пайплайна.\r\nThe show must go on: как нагрузить конференцию, чтобы держать 10 тысяч участников\r\nДоклад на русском языкеRU\r\nС 2019 года в JUG Ru Group разрабатывают решение для проведения онлайн-конференций. Также команда стала использовать это же решение для проведения митапов внешних заказчиков. Одним из требований к решению является масштабируемость и отказоустойчивость: несмотря ни на что решение должно «держать» конференцию с 10К онлайн-участниками. The show must go on!\r\n\r\nВладимир расскажет про основные компоненты решения, почему в качестве инструмента нагрузочного тестирования была выбрана связка gatling и nanocloud, как был построен профиль нагрузки и какие оптимизации в компонентах решения и инфраструктуре были проведены чтобы приблизиться к заветным 10K.",
      "organizer": "COMPANY",
      "partners": "QA Automation, IT-Events",
      "address": "Park Inn by Radisson Pulkovskaya, пл. Победы, 1, Санкт‑Петербург",
      "price": "32000.00",
      "date_start": "2023-10-15T10:00:00Z",
      "date_end": "2023-10-16T19:30:00Z",
      "created_at": "2023-07-12T12:04:40.809927Z",
      "city": "Санкт‑Петербург",
      "tags": [
        {
          "id": 13,
          "name": "C#",
          "slug": "c-sharp"
        },
        {
          "id": 35,
          "name": "Data Processing",
          "slug": "dataprocessing"
        },
        {
          "id": 9,
          "name": "FastAPI",
          "slug": "fastapi"
        },
        {
          "id": 8,
          "name": "JavaScript",
          "slug": "javascript"
        },
        {
          "id": 17,
          "name": "MySQL",
          "slug": "mysql"
        },
        {
          "id": 6,
          "name": "PostgreSQL",
          "slug": "postgresql"
        },
        {
          "id": 49,
          "name": "UX/UI",
          "slug": "ux-ui"
        }
      ],
      "topic": [
        {
          "id": 5,
          "name": "Artificial Intelligence and Machine Learning",
          "slug": "artificial-intelligence-and-machine-learning"
        }
      ],
      "format": [
        {
          "id": 2,
          "name": "Offline",
          "slug": "offline"
        },
        {
          "id": 1,
          "name": "Online",
          "slug": "online"
        }
      ],
      "isLiked": true
    },
    {
      "id": 25,
      "title": "ArchDays",
      "description": "Конференция по архитектуре IT-решений ArchDays\r\nМы определяем цель конференции как «распространение имеющихся и создание новых знаний об архитектуре  программных решений».\r\nМы решили пойти дальше принятого формата и в дополнение к докладам, преследующим своей целью распространение знаний, попытаться найти решения еще не решенных проблем в архитектуре.",
      "url": "https://archdays.ru/#about_conference",
      "image": "http://80.87.107.15/media/events/image/%D0%A1%D0%BD%D0%B8%D0%BC%D0%BE%D0%BA_%D1%8D%D0%BA%D1%80%D0%B0%D0%BD%D0%B0_2023-06-10_%D0%B2_00.52.23.png",
      "image_small": null,
      "program": "Тематики конференции:\r\nПроцессы проектирования\r\nИнструменты проектирования\r\nПрактики проектирования\r\nОбучение архитектуре\r\nСобственная разработка\r\nПрограмма формируется, в ней будет около 35 выступлений, идущих параллельно в 5 залах.",
      "organizer": "Тест",
      "partners": "",
      "address": "Москва",
      "price": "24900.00",
      "date_start": "2023-10-27T10:00:00Z",
      "date_end": "2023-10-27T18:00:00Z",
      "created_at": "2023-06-09T21:56:49.019000Z",
      "city": "Москва",
      "tags": [
        {
          "id": 45,
          "name": "architecture of IT solutions",
          "slug": "architectureitsolutions"
        }
      ],
      "topic": [
        {
          "id": 15,
          "name": "Backend",
          "slug": "backend"
        }
      ],
      "format": [
        {
          "id": 2,
          "name": "Offline",
          "slug": "offline"
        }
      ],
      "isLiked": true
    }
  ]